Documents/ВводПоказанийПриборовОтопление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВводПоказанийПриборовОтопление</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовОтопление</xr:Item>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПриборыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоКубов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредварительныйРассчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПоказанияПУИзВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПУИзВнешнихИсточников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетПоказанийПриборовОтопление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетПоказанийПриборовОтопление</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорректировкаПоказаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Энергоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИсточникиПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ИсточникиПоказаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СайтЖКХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаExcel</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оператор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телеграм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктХолоднойВоды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОтопление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ПриборыУчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тарифность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТарифностьСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРегистрацииПоказаний</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРегистрацииПоказанийСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрядность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщедомовойСчетчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ВводПоказанийПриборовОтопление/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//Для Каждого стр Из ПриборыУчета Цикл
	//	НаборЗаписей = РегистрыСведений.ПоказанияПУИзВнешнихИсточников.СоздатьМенеджерЗаписи();
	//	НаборЗаписей.Период = ПериодНачисления;
	//	НаборЗаписей.ВидТарифа = стр.ВидТарифа;
	//	Если НЕ ЗначениеЗаполнено(стр.ТекущиеПоказания) Тогда
	//		НаборЗаписей.Значение = стр.ПредыдущиеПоказания;
	//	Иначе
	//	    НаборЗаписей.Значение  = стр.ТекущиеПоказания;
	//	КонецЕсли;
	//	НаборЗаписей.Источник  = стр.Источник;
	//	НаборЗаписей.ПриборУчета = стр.ПриборУчета;
	//	НаборЗаписей.Записать(Истина);
	//КонецЦикла;

		ТипИсточника = Перечисления.ИсточникиПоказаний.РучнаяОперация;
	
	
	ТабЗаполнения = ПриборыУчета.Выгрузить().Скопировать();
	МассивСтрокУдаления = Новый Массив;
	Для каждого Строка Из ТабЗаполнения  Цикл
	   Если ТипЗнч(Строка.ПриборУчета) = Тип("Строка") тогда
			МассивСтрокУдаления.Добавить(Строка);
		КонецЕсли;	
	
	КонецЦикла; 
	
	
	Для каждого НайденнаяСтрока Из МассивСтрокУдаления Цикл
			ТабЗаполнения.Удалить(НайденнаяСтрока);
	КонецЦикла;
		

	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТЗ",ТабЗаполнения);
	

	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.ПриборУчета,
	               |	ТЗ.ВидТарифа,
	               |	ТЗ.ТекущиеПоказания
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ВТ.ТекущиеПоказания) КАК ПоказаниеТекущее,
	               |	ВТ.ВидТарифа,
	               |	ВТ.ПриборУчета
	               |ИЗ
	               |	ВТ КАК ВТ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.ПриборУчета,
	               |	ВТ.ВидТарифа";
	ТЗ_ТаблицаПоказаний = Запрос.Выполнить().Выгрузить();
	
	
	Если ПриборыУчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.ПоказанияПУИзВнешнихИсточников.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Период.Установить(Дата);
	ТаблицаПриборыУчета = НаборЗаписей.Выгрузить(,);
	
	Для каждого Строка Из ТЗ_ТаблицаПоказаний  Цикл
		
		Если Строка.ПоказаниеТекущее = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если Строка.ПриборУчета = Справочники.ПриборыУчета.ПустаяСсылка()  тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтрока = ТаблицаПриборыУчета.Добавить();
	    НоваяСтрока.Период = Дата;
		НоваяСтрока.ПриборУчета = Строка.ПриборУчета;
		НоваяСтрока.ВидТарифа = Строка.ВидТарифа;
		НоваяСтрока.Значение = Строка.ПоказаниеТекущее;
		НоваяСтрока.Источник = ТипИсточника;
	КонецЦикла; 
	ТаблицаПриборыУчета.Сортировать("ПриборУчета");
	НаборЗаписей.Загрузить(ТаблицаПриборыУчета);
	НаборЗаписей.Записать(Ложь);
	
	// регістр РасчетПоказанийПриборовОтопление Приход
	Движения.РасчетПоказанийПриборовОтопление.Записывать = Истина;
	Для Каждого ТекСтрокаПриборыУчета Из ПриборыУчета Цикл
		Движение = Движения.РасчетПоказанийПриборовОтопление.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ОбъектУстановки = ЛицевойСчет;
		Движение.ПриборУчета = ТекСтрокаПриборыУчета.ПриборУчета;
		Движение.Услуга = Услуга;
		Движение.ВидТарифа = ТекСтрокаПриборыУчета.ВидТарифа;
		Движение.Значение = ТекСтрокаПриборыУчета.КвоКубов;
	КонецЦикла;
	
	// Регістр відомостей ПоказанияПриборовУчета

	НаборЗаписей = РегистрыСведений.ПоказанияПриборовУчета.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);

	ТаблицаПриборыУчета = НаборЗаписей.Выгрузить(,);
	
	Для каждого Строка Из ТЗ_ТаблицаПоказаний  Цикл
		
		Если Строка.ПоказаниеТекущее = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если Строка.ПриборУчета = Справочники.ПриборыУчета.ПустаяСсылка()  тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтрока = ТаблицаПриборыУчета.Добавить();
	    НоваяСтрока.Период = Дата;
		НоваяСтрока.ПриборУчета = Строка.ПриборУчета;
		НоваяСтрока.ВидТарифа = Строка.ВидТарифа;
		НоваяСтрока.Значение = Строка.ПоказаниеТекущее;
		НоваяСтрока.Отключен = Ложь;
		НоваяСтрока.Регистратор = ЭтотОбъект.Ссылка;
		НоваяСтрока.Источник = Перечисления.ИсточникиПоказаний.Оператор;
		НоваяСтрока.Активность = Истина;
	КонецЦикла; 
	ТаблицаПриборыУчета.Сортировать("ПриборУчета");
	НаборЗаписей.Загрузить(ТаблицаПриборыУчета);
	НаборЗаписей.Записать(Ложь);
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	//ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	//
	// Подготовка наборов записей
	//ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	//
	// Запись наборов записей
	//ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	Для Каждого стр Из ПриборыУчета Цикл
		НаборЗаписей = РегистрыСведений.ПоказанияПУИзВнешнихИсточников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПриборУчета.Установить(стр.ПриборУчета);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры
